Revit 2027 API
ScheduleField.TotalByAssemblyType Property
 In an assembly schedule view, indicates if totals are calculated for all assembly instances of the same type or only for a single instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool TotalByAssemblyType { get; set; }
Public Property TotalByAssemblyType As Boolean
	Get
	Set
public:
property bool TotalByAssemblyType {
	bool get ();
	void set (bool value);
}
member TotalByAssemblyType : bool with get, set
Property Value
Boolean
 True if totals are calculated for all assembly instances. False if totals are calculated for one instance.
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property: This ScheduleField cannot be totaled by assembly type. -or- When setting this property: Totals are not enabled for this ScheduleField.
See Also
Reference
ScheduleField Class
Autodesk.Revit.DB Namespace